{
  "p1": "It was in early 2000 in the midst of a very intensive business career that my longing for something “beyond” became more and more intense. I was a major participant in the world of global finance, with all the trappings of success. Yet, I was tormented by life’s bigger questions – “What is enough?” “Why am I here?” “What is success really?” “What makes me happy?” I longed for the answers, but I did not know what they were or how I would find them.",
  "p2": "In the early stages of this complicated journey, I turned to what I have relied on since childhood – prayer. I also took up music again and realized that the happiest moments of my life involved singing.",
  "p3": "Reconnecting with my music opened up doorways to deeper practices like breath work and meditation, opening up profound wisdom within myself.",
  "p4": "I went from being a stressed out, type-A executive to a much more multidimensional, lighter being. I made a commitment to intensively serve the world with a purity of purpose that became a guiding principle – my daily mantra.",
  "p5": "As I slowly began to experience the light within myself, wondrously it started a journey of seeing and reflecting the light in and all around me. Suddenly, even Peace for everyone does not seem enough. I want the world to be enveloped in abundant blessings – all the time.",
  "p6": "In my remaining years, I feel a great urgency to make my corner of this extraordinary planet better in any way I can, and be a happy human being in the process.",
  "p7": "It is a challenge, but it gets easier every day...",
  "teaser": "We all seek something. I am no exception.",
  "p1_mobile_extended": "I was a major participant in the world of global finance, with all the trappings of success. Yet, I was tormented by life’s bigger questions – “What is enough?” “Why am I here?” “What is success really?” “What makes me happy?” I longed for the answers, but I did not know what they were or how I would find them.",
  "extended": "It was in early 2000 in the midst of a very intensive business career that my longing for something beyond became more and more intense..."
  
}